_TEXT_SQUAT = """
        *Фронтальные приседания* — это упражнение с гантелями или штангой, при котором вы опускаетесь в приседание, удерживая груз перед собой на уровне груди.
        Оно направлено на развитие силы ног, особенно квадрицепсов, ягодиц и спины. Упражнение также требует хорошей координации и равновесия, что делает его эффективным для функциональной тренировки всего тела.

        ❗ Для правильного выполнения упражнения следует соблюдать следующие правила:\n
            1. Ваши ноги должны быть на ширине плеч.\n
            2. Локти не дожны быть сильно опущены вниз.\n
            3. Направление коленей во время приседаний должно быть строго по направлению
               носков.
    """

_TEXT_PUSH_UP = """
        *Отжимания с широкой постановкой рук* — это вариант отжиманий, которые отлично подходят для развития силы грудных мышц и укрепления верхней части тела.
        Это упражнение также способствует улучшению стабильности и контроля над телом. При правильном выполнении оно может быть эффективным инструментом для укрепления мышц и повышения общей физической формы.

        ❗ Для правильного выполнения упражнения следует соблюдать следующие правила:\n
            1. Ваши руки должны располагаться на ширине больше, чем ширина плеч.\n
            2. Локти не должны быть направлены сильно в стороны.
               Старайтесь слегка отвести их назад.\n
            3. Держите спину прямо.
    """

_TEXT_BICEPS = """
        *Упражнение с гантелями на бицепс* — это эффективное упражнение на бицепсы, которое можно выполнять как стоя, так и сидя. Основная цель этого упражнения — укрепление бицепсов и улучшение формы рук.
        Упражнение выполняется с гантелями, что позволяет работать с каждой рукой отдельно, обеспечивая равномерное развитие мышц и помогая исправлять асимметрию.

        ❗ Для правильного выполнения упражнения следует соблюдать следующие правила:\n
            1. Ваши ноги должны быть на ширине плеч.\n
            2. При подъеме гантели не старайтесь поднять ее засчет маха руки.
               Старайте поднимать гантель именно бицепсом.\n
            3. Локти должны быть зафиксированы у тела.\n
            4. Держите спину прямо и не отводите таз вперед.
    """

_TEXT_REVERSE_PUSH_UP = """
        *Обратные отжимания* — это не только отличное упражнение для формирования выразительных плеч, но и замечательный способ укрепить верхнюю часть спины,
        сделать её более подтянутой и снизить риск возникновения болей в плечевых суставах.
        Упражнение выполняется с использованием стула, скамьи или параллельных брусьев, и оно подходит как для начинающих, так и для опытных спортсменов.

        ❗ Для правильного выполнения упражнения следует соблюдать следующие правила:\n
            1. При выполнении упражнения не разводите локти слишком сильно в стороны.\n
            2. Таз должен находиться близко к скамье или стулу.\n
            3. Руки находнятся примерно на ширине плеч или чуть шире.\n
            4. Держите спину прямо.
    """